; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 458719 2 3 3 6 3
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	infrared0 - mode
	infrared1 - mode
	image2 - mode
	GroundStation0 - direction
	Star1 - direction
	Star2 - direction
	Star3 - direction
	Star5 - direction
	Star4 - direction
	Planet6 - direction
	Planet7 - direction
	Planet8 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 image2)
	(calibration_target instrument0 Star5)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 Star4)
	(supports instrument2 infrared0)
	(supports instrument2 image2)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet6)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star4)
	(supports instrument4 infrared1)
	(supports instrument4 image2)
	(calibration_target instrument4 Star4)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet7)
)
(:goal (and
	(pointing satellite1 Star2)
	(have_image Planet6 image2)
	(have_image Planet7 image2)
	(have_image Planet8 infrared1)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 4
2. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 4
3. (turn_to satellite0 star4 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star4)
   goals met: 0 of 4
4. (turn_to satellite1 star4 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 star4)
   goals met: 0 of 4
5. (calibrate satellite0 instrument1 star4)
   added: (calibrated instrument1)
   goals met: 0 of 4
6. (calibrate satellite1 instrument4 star4)
   added: (calibrated instrument4)
   goals met: 0 of 4
7. (turn_to satellite1 star2 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 star2)
   goals met: 1 of 4
8. (turn_to satellite0 planet8 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 planet8)
   goals met: 1 of 4
9. (take_image satellite0 planet8 instrument1 infrared1)
   added: (have_image planet8 infrared1)
   goals met: 2 of 4
10. (turn_to satellite1 planet6 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 planet6)
   goals met: 1 of 4
11. (take_image satellite1 planet6 instrument4 image2)
   added: (have_image planet6 image2)
   goals met: 2 of 4
12. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 2 of 4
13. (turn_to satellite1 star2 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star2)
   goals met: 3 of 4
14. (turn_to satellite1 planet7 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 planet7)
   goals met: 2 of 4
15. (take_image satellite1 planet7 instrument4 image2)
   added: (have_image planet7 image2)
   goals met: 3 of 4
16. (turn_to satellite1 star2 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 star2)
   goals met: 4 of 4
